load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
      name: "Load injection ramp"
  defaults:
    headers:
      content-type: "application/json"
      x-api-key: "nf_key_e2etestsecretkey1234567890"
scenarios:
  - name: "Ingest client transaction events"
    flow:
      - post:
          url: "/v1/events"
          json:
            clientEventId: "load-txn-{{ $uuid }}"
            tenantId: "tenant-77777777-7777-4777-a777-777777777777"
            userId: "user-e2e-opt-in"
            eventType: "order.placed"
            payload:
              name: "Load Test User"
              orderId: "ord-{{ $uuid }}"